#include <stdio.h>

void commit()
{ 
	printf("Hello World\n\n");
	printf("14학번 이연규 입니다.");
	
	printf("모두 영상보고 동기화 해주세요\n");
	printf("커밋 날려주세요\n");
	/*
	Hit(힛) - 플레이어가 추가 카드를 더 원할 때 딜러에게 표현하는 용어
	Stay(스테이) - 플레이어가 추가 카드를 더 이상 원하지 않을 때 딜러에게 표현하는 용어
	Bust(버스트) - 플레이어가 추가 카드를 받아서(Hit) 21을 초과하였을 때 딜러가 표현하는 용어
	Push(푸시) - 딜러와 플레이어의 카드 합이 같을 때 딜러가 표현하는 용어(Tie라고도 함) 
	*/

	//14학번 홍수빈


}

void post_programing()
{
	//두개의 저장소-딜러와 플레이어
	//게임시작시 배팅금액을 걸고
	//딜러는 앞면으로 한장 뒷면으로 한장 플레이어는 앞면으로 한장을 받는다
	//플레이어는 딜러의 앞면 카드와 자신의 카드 두장의 합을 생각하여
	//한장 더받을지(Hit), 멈출지(Stand) 결정한다.
	//카드를 받았을 때 Bust 되면 즉시 플레이어의 패배가 된다. (딜러의 패공개& 딜러의 승리라고 출력)
	//딜러는 카드의 합이 15이하라면 한장을 더 받아야한다.
	//플레이어가 Stand하기로 결정하면 딜러의 두번째 카드가 공개되고,
	//딜러가 카드를 더 받을지 멈출지 판단하여 게임이 종료된다.
	//딜러가 카드를 다 받고 Stand 하게 되거나 음   ...


}